Revit 2026 API

# ElementMulticlassFilter(IListType, Boolean) Constructor

---

Initializes a new instance of the ElementMulticlassFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticlassFilter(
	IList<Type> typeList,
	bool inverted
)
```
```vb
Public Sub New (
	typeList As IList(Of Type),
	inverted As Boolean
)
```
```cpp
public:
ElementMulticlassFilter(
	IList<Type^>^ typeList,
	bool inverted
)
```
```fsharp
new :
        typeList : IList<Type> *
        inverted : bool -> ElementMulticlassFilter
```

#### Parameters

typeList IListType

inverted Boolean

#### Reference

ElementMulticlassFilter Class

ElementMulticlassFilter Overload

Autodesk.Revit.DB Namespace